Autodesk.Revit.DB.ExtensibleStorage.SchemaAccessOverride.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExtensibleStorage.SchemaAccessOverride.#ctor(System.Guid,System.String)
Activate the scope for the client/vendor.
clientId:
GUID representing the client
vendorId:
Id of the vendor.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021.1

Autodesk.Revit.DB.ExtensibleStorage.SchemaAccessOverride
Provide a mechanism to override schema access for a specified client and vendor.
Remarks:
Access levels to schema data is controlled by the active client and associated vendor
id's at time of access.
By default, this gets set based on what client or addin is reacting to an event or
command.
SchemaAccessOverride allows overriding of schema access by specifying the
client guid and vendor id to override with. The override lasts for scope of the object.
Since:
2021.1